In [2]:
import pandas as pd

In [3]:
data = [[1,2,3],[4,5,6],[7,8,9]]

In [9]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
df = pd.DataFrame(data, list('321'), list('XYZ'))

In [12]:
df

   X  Y  Z
3  1  2  3
2  4  5  6
1  7  8  9

In [15]:
df.sort_index(inplace = True, axis = 1)

In [16]:
df

   X  Y  Z
1  7  8  9
2  4  5  6
3  1  2  3

In [17]:
df.sort_values(by = 'X', inplace = True)

In [18]:
df

   X  Y  Z
3  1  2  3
2  4  5  6
1  7  8  9